<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>JSP예제</title>
</head>
<body>
<h1>JSP란?</h1>
<p>
Servlet 클래스를 만들기 위한 템플릿 파일이다.<br>
콘텐츠를 출력하는 자바 코드를 자동으로 생성한다.<br>
그래서 JSP는 출력을 도와주기 위해 나온 기술이다.<br>
또한 JSP 전용 태그를 사용하면 특정 자바 코드를 자동으로 생성한다.<br>
그래서 자바를 잘 모르는 일반 사용자들도 쉽게 웹 페이지를 만들라고 나온 기술이다.<br>
개발자가 기존 태그 외에 특정 기능을 수행하는 새로운 태그를 만들 수 있다.<br>
그래서 개발자는 코드에 집중하고 UI 작성자는 디자인에 집중하는 방식으로 
협업을 수행할 수 있다.<br>
하지만, JSP 전용 태그나 개발자가 만든 태그도 사용법을 배워야함으로 
협업에서는 이런 이상적인 방식으로 작업을 수행하지 않는다.<br>
그냥 개발자가 다 한다.<br>
</p>

<h2>결론!</h2>
<p>HTML 콘텐츠를 출력하기 위해 자바 코드를 작성하지 않는 것 만으로 
이미 JSP이 가치는 충분하다!</p>

<p>지금까지 그냥 편안하게 작성한 이 모든 텍스트는 Servlet 클래스를 만들 때
그대로 출력문 코드로 바뀐다.</p>

</body>
</html>






